{
  "books": [
    {
      "title": "Sapiens: A Brief History of Humankind",
      "image": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1703329310i/23692271.jpg",
      "author": "Yuval Noah Harari",
      "description": "From a renowned historian comes a groundbreaking narrative of humanity’s creation and evolution—a #1 international bestseller—that explores the ways in which biology and history have defined us and enhanced our understanding of what it means to be “human.” One hundred thousand years ago, at least six different species of humans inhabited Earth. Yet today there is only one—homo sapiens. What happened to the others? And what may happen to us? Most books about the history of humanity pursue either a historical or a biological approach, but Dr. Yuval Noah Harari breaks the mold with this highly original book that begins about 70,000 years ago with the appearance of modern cognition.",
      "genres": [
        "Nonfiction",
        "History",
        "Science"
      ],
      "publishing_year": 2011,
      "id": 7
    },
    {
      "image": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1170803558l/72193.jpg",
      "title": "Harry Potter and the Philosopher’s Stone",
      "author": "J.K. Rowling",
      "description": "Harry Potter thinks he is an ordinary boy - until he is rescued by an owl, taken to Hogwarts School of Witchcraft and Wizardry, learns to play Quidditch and does battle in a deadly duel. The Reason ... HARRY POTTER IS A WIZARD!",
      "genres": [
        "Fantasy",
        "Fiction",
        "Magic"
      ],
      "publishing_year": 1997,
      "id": 8
    },
    {
      "image": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1486837149i/131359.jpg",
      "title": "Death on the Nile",
      "author": "Agatha Christie",
      "description": "Agatha Christie's most daring travel mystery.\n\nThe tranquility of a lovely cruise along the Nile is shattered by the discovery that Linnet Ridgeway has been shot. She was young, stylish and beautiful, a girl who had everything – until she lost her life.\n\nWho is also on board? Christie's great detective Hercule Poirot is on holiday. He recalls an earlier outburst by a fellow passenger: ‘I’d like to put my dear little pistol against her head and just press the trigger.’ Despite the exotic setting, nothing is ever quite what it seems…",
      "genres": [
        "Mystery",
        "Fiction",
        "Crime"
      ],
      "publishing_year": 1937,
      "id": 9
    },
    {
      "image": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1688011813i/27362503.jpg",
      "title": "It Ends with Us",
      "author": "Colleen Hoover",
      "description": "Lily hasn’t always had it easy, but that’s never stopped her from working hard for the life she wants. She’s come a long way from the small town in Maine where she grew up — she graduated from college, moved to Boston, and started her own business. So when she feels a spark with a gorgeous neurosurgeon named Ryle Kincaid, everything in Lily’s life suddenly seems almost too good to be true.\n\nRyle is assertive, stubborn, maybe even a little arrogant. He’s also sensitive, brilliant, and has a total soft spot for Lily. And the way he looks in scrubs certainly doesn’t hurt. Lily can’t get him out of her head. But Ryle’s complete aversion to relationships is disturbing. Even as Lily finds herself becoming the exception to his “no dating” rule, she can’t help but wonder what made him that way in the first place.\n\nAs questions about her new relationship overwhelm her, so do thoughts of Atlas Corrigan — her first love and a link to the past she left behind. He was her kindred spirit, her protector. When Atlas suddenly reappears, everything Lily has built with Ryle is threatened.",
      "genres": [
        "Romance",
        "Fiction"
      ],
      "publishing_year": 2016,
      "id": 10
    },
    {
      "image": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1674418461i/65916344.jpg",
      "title": "Holly",
      "author": "Stephen King",
      "description": "Holly Gibney, one of Stephen King’s most compelling and ingeniously resourceful characters, returns in this thrilling novel to solve the gruesome truth behind multiple disappearances in a midwestern town.\n\n“Sometimes the universe throws you a rope.” — BILL HODGES\n\nStephen King’s Holly marks the triumphant return of beloved King character Holly Gibney. Readers have witnessed Holly’s gradual transformation from a shy (but also brave and ethical) recluse in Mr. Mercedes to Bill Hodges’s partner in Finders Keepers to a full-fledged, smart, and occasionally tough private detective in The Outsider. In King’s new novel, Holly is on her own, and up against a pair of unimaginably depraved and brilliantly disguised adversaries.\n\nWhen Penny Dahl calls the Finders Keepers detective agency hoping for help locating her missing daughter, Holly is reluctant to accept the case. Her partner, Pete, has Covid. Her (very complicated) mother has just died. And Holly is meant to be on leave. But something in Penny Dahl’s desperate voice makes it impossible for Holly to turn her down.\n\nMere blocks from where Bonnie Dahl disappeared live Professors Rodney and Emily Harris. They are the picture of bourgeois respectability: married octogenarians, devoted to each other, and semi-retired lifelong academics. But they are harboring an unholy secret in the basement of their well-kept, book-lined home, one that may be related to Bonnie’s disappearance. And it will prove nearly impossible to discover what they are up to: they are savvy, they are patient, and they are ruthless.\n\nHolly must summon all her formidable talents to outthink and outmaneuver the shockingly twisted professors in this chilling new masterwork from Stephen King.",
      "genres": [
        "Horror",
        "Fiction",
        "Thriller"
      ],
      "publishing_year": 2023,
      "id": 11
    },
    {
      "image": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1664729357i/62848145.jpg",
      "title": "The Housemaid's Secret",
      "author": "Freida McFadden",
      "description": "It's hard to find an employer who doesn't ask too many questions about my past. So I thank my lucky stars that the Garricks miraculously give me a job, cleaning their stunning penthouse with views across the city and preparing fancy meals in their shiny kitchen. I can work here for a while, stay quiet until I get what I want.\n\nIt's almost perfect. But I still haven't met Mrs Garrick, or seen inside the guest bedroom. I'm sure I hear her crying. I notice spots of blood around the neck of her white nightgowns when I'm doing laundry. And one day I can't help but knock on the door. When it gently swings open, what I see inside changes everything....\n\nThat's when I make a promise. After all, I've done this before. I can protect Mrs. Garrick while keeping my own secrets locked up safe.\n\nDouglas Garrick has done wrong. He is going to pay. It's simply a question of how far I'm willing to go....",
      "genres": [
        "Thriller",
        "Mystery",
        "Suspense"
      ],
      "publishing_year": 2023,
      "id": 12
    },
    {
      "image": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1613669389i/55527921.jpg",
      "title": "Court",
      "author": "Tracy Wolff",
      "description": "No one survived the last battle unscathed. Flint is angry at the world, Jaxon is turning into something I don’t recognize, and Hudson has put up a wall I’m not sure I’ll ever break through.\n\nNow war is coming, and we’re not ready. We’re going to need an army to have any hope of winning. But first, there are questions about my ancestors that need answers. Answers that might just reveal who the real monster is among us.\n\nAnd that’s saying something in a world filled with bloodthirsty vampires, immortal gargoyles, and an ancient battle between two gods.\n\nThere’s no guarantee that anyone will be left standing when the dust settles, but if we want to save this world, I have no choice. I’ll have to embrace every part of me...even the parts I fear the most.",
      "genres": [
        "Fantasy",
        "Romance",
        "Paranormal"
      ],
      "publishing_year": 2022,
      "id": 13
    }
  ]
}